app/controllers/hookups_controller.rb

  def index
    @hookups = Hookup.all
---
SELECT "hookups".* FROM "hookups"

  def show
    @hookup = Hookup.find(params[:id])
    @hookup.composite_score = @hookup.personality + @hookup.level_of_attraction + @hookup.intenseness_of_orgasm + @hookup.dick
    if @hookup.did_you_cum then
      @hookup.composite_score += 5
    end
    if @hookup.did_you_cuddle_afterwards then
      @hookup.composite_score += 5
    end
    @hookup.save
---
SELECT  "hookups".* FROM "hookups" WHERE "hookups"."id" = ? LIMIT 1  [["id", 980190962]]
UPDATE "hookups" SET "composite_score" = ?, "updated_at" = ? WHERE "hookups"."id" = ?  [["composite_score", 4], ["updated_at", "2016-06-05 06:08:16.861932"], ["id", 980190962]]

  def create
    @hookup = Hookup.new(hookup_params)

    respond_to do |format|
      if @hookup.save
---
INSERT INTO "hookups" ("name", "age", "personality", "level_of_attraction", "intenseness_of_orgasm", "dick", "did_you_cum", "did_you_cuddle_afterwards", "composite_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @hookup.destroy
---
DELETE FROM "hookups" WHERE "hookups"."id" = ?  [["id", 980190962]]

    def set_hookup
      @hookup = Hookup.find(params[:id])
---
SELECT  "hookups".* FROM "hookups" WHERE "hookups"."id" = ? LIMIT 1  [["id", 980190962]]